--- a/Part6_PatternBehavior/ch20_observer.md
+++ b/Part6_PatternBehavior/ch20_observer.md
@@ -45,48 +45,37 @@ class Stock {
 
 <!-- ![](https://hackmd.io/_uploads/HJc4U0VEn.png) -->
 ###  20.2.1 結構
-```plantuml
-@startuml
-interface Observer {
-    +update(subj: Subject)
-}
+```mermaid
+classDiagram
+    class Observer {
+        <<interface>>
+        +update(subj: Subject)
+    }
 
-abstract class Subject {
-    -obs: list(Observer)
-    #addObserver(ob: Observer)
-    #removeObserver(ob: Observer)
-    +notifyObservers()
-}
+    class Subject {
+        <<abstract>>
+        -obs: List~Observer~
+        #addObserver(ob: Observer)
+        #removeObserver(ob: Observer)
+        +notifyObservers()
+    }
 
-class ConcreteSubject {
-    -state: int
-    +setState(state: int)
-}
+    class ConcreteSubject {
+        -state: int
+        +setState(state: int)
+    }
 
-class ConcreteObserver {
-    +update(subj: Subject)
-}
+    class ConcreteObserver {
+        +update(subj: Subject)
+    }
 
-Subject <|-- ConcreteSubject
-Observer <|-- ConcreteObserver
-Subject -> Observer
+    Subject <|-- ConcreteSubject
+    Observer <|.. ConcreteObserver
+    Subject --> Observer
 
-note left of Subject::notifyObservers
-   for all obs in Observer
-      obs.update()
-end note
-
-note left of ConcreteSubject
-   setState() 會改變狀態;
-   呼叫 notifyObservers()
-end note
-
-note bottom of ConcreteObserver
-   update():
-      實作改變呈現的方法
-end note
-
-@enduml
+    note for Subject "notifyObservers()\nfor all obs in Observer\nobs.update()"
+    note for ConcreteSubject "setState() 會改變狀態;\n呼叫 notifyObservers()"
+    note for ConcreteObserver "update():\n實作改變呈現的方法"
 ```
 
 FIG: `Observer` Structure
